# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
     [-1, 1, Silence, []],  #0
     [-1, 1, SpectralFeatureAdaptation, [3]], #1
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 2-P1/2

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 3-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 4
     [-1, 1, eca_layer, []], # 5

   # conv down
   [-1, 1, ADown, [128]],  # 6-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 7
     [-1, 1, eca_layer, []], # 8

   # conv down
  [-1, 1, ADown, [256]],  # 9-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 10
     [-1, 1, eca_layer, []], # 11

   # conv down
   [-1, 1, ADown, [256]],   # 12-P5/32
     [-1, 1, CBAM, [256]], #13

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 14
     [-1, 1, eca_layer, []], # 15
  ]

# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [256, 128]],  # 16

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #17
   [[-1, 10], 1, Concat, [1]],  # cat backbone P4 18

   # elan-2 block
   [-1, 1, depthwise_separable_conv, [256, 3, 1]],  # 19

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #20
   [[-1, 8], 1, Concat, [1]],  # cat backbone P3 21

   # elan-2 block
   [-1, 1, depthwise_separable_conv, [128, 3, 1]],# 22 (P3/8-small)

   # conv-down merge
   [-1, 1, Conv, [128, 3, 2]], #23
   [[-1, 19], 1, Concat, [1]],  # cat head P4 24

   # elan-2 block
    [-1, 1, depthwise_separable_conv, [256, 3, 1]], # 25 (P4/16-medium)

   # conv-down merge
   [-1, 1, Conv, [256, 3, 2]], #26
   [[-1, 16], 1, Concat, [1]],  # cat head P5 27

   # elan-2 block
   [-1, 1, depthwise_separable_conv, [256, 3, 1]],  # 28 (P5/32-large)

   # routing
   [8, 1, CBLinear, [[128]]], # 29
   [11, 1, CBLinear, [[128, 256]]], # 30
   [15, 1, CBLinear, [[128, 256, 256]]], # 31

   # conv down
   [0, 1, Conv, [32, 3, 2]],  # 32-P1/2

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 33-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 34
   [-1, 1, eca_layer, []], # 35

   # conv down fuse
   [-1, 1, Conv, [128, 3, 2]],  # 36-P3/8
   [[29, 30, 31, -1], 1, CBFuse, [[0, 0, 0]]], # 37
     [-1, 1, CoordAtt, [128, 128, ]], #38
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 39
   [-1, 1, eca_layer, []], # 40

   # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  # 40-P4/16
   [[30, 31, -1], 1, CBFuse, [[1, 1]]], # 41
     [-1, 1, CoordAtt, [256, 256, ]], #42
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 43
   [-1, 1, eca_layer, []], # 44

   # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  # 45-P5/32
   [[31, -1], 1, CBFuse, [[2]]], # 46

   [-1, 1, CoordAtt, [256, 256, ]], #47
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 48
   [-1, 1, eca_layer, []], # 49

   # detect
   [[40, 44, 49, 22, 25, 28], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]
