# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# YOLOv9 backbone
backbone:
  [
     [-1, 1, Silence, []],  #0
     [-1, 1, Silence, []], #1
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 2-P1/2

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 3-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 4

   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 5-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 6

   # conv down
   [-1, 1, Conv, [256, 3, 2]],  # 7-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 8

   # conv down
   [-1, 1, Conv, [256, 3, 2]],  # 9-P5/32
     [-1, 1, GLAM, [256, 3]], #10

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 11
  ]

# YOLOv9 head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [256, 128]],  # 10

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 13

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 16 (P3/8-small)

   # conv-down merge
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 19 (P4/16-medium)

   # conv-down merge
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 22 (P5/32-large)
   
   # routing
   [6, 1, CBLinear, [[128]]], # 23
   [8, 1, CBLinear, [[128, 256]]], # 24
   [11, 1, CBLinear, [[128, 256, 256]]], # 25
   
   # conv down
   [0, 1, Conv, [32, 3, 2]],  # 26-P1/2

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 27-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1]],  # 28

   # conv down fuse
   [-1, 1, Conv, [128, 3, 2]],  # 29-P3/8
   [[25, 26, 27, -1], 1, CBFuse, [[0, 0, 0]]], # 30  
   [-1, 1, Silence, []],
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 31

   # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  # 32-P4/16
   [[26, 27, -1], 1, CBFuse, [[1, 1]]], # 33 
    [-1, 1, Silence, []],
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 34

   # conv down fuse
   [-1, 1, Conv, [256, 3, 2]],  # 35-P5/32
   [[27, -1], 1, CBFuse, [[2]]], # 36
    
   [-1, 1, Silence, []],
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 40

   # detect
   [[34, 37, 40, 18, 21, 24], 1, DualDDetect, [nc]],  # DualDDetect(A3, A4, A5, P3, P4, P5)
  ]